The groupby methon allows you to group rows of data together and call aggregrate functions

In [2]:
import pandas as pd

#Creating a dataframe

data = {'Company':['Google','Google','MicroSoft','MicroSoft','FaceBook','FaceBook'],
       'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales': [200,120,340,123,243,350]}

In [4]:
df =pd.DataFrame(data)

In [5]:
df

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  MicroSoft      Amy    340
3  MicroSoft  Vanessa    123
4   FaceBook     Carl    243
5   FaceBook    Sarah    350

Now we can use the .groupby() method to group rows together based off a column name. For instance let's group based off company. This will cfreate a DataFrameGroupBy object:

In [6]:
df.groupby('Company')

We can aslo save this object as a new variable:

In [7]:
by_company = df.groupby("Company")

And then call aggregrate methods off the boject:

In [8]:
by_company.mean()

           Sales
Company
FaceBook   296.5
Google     160.0
MicroSoft  231.5

In [9]:
df.groupby('Company').mean()

           Sales
Company
FaceBook   296.5
Google     160.0
MicroSoft  231.5

More examples

In [11]:
by_company.std()

                Sales
Company
FaceBook    75.660426
Google      56.568542
MicroSoft  153.442172

In [12]:
by_company.min()

            Person  Sales
Company
FaceBook      Carl    243
Google     Charlie    120
MicroSoft      Amy    123

In [13]:
by_company.max()

            Person  Sales
Company
FaceBook     Sarah    350
Google         Sam    200
MicroSoft  Vanessa    340

In [14]:
by_company.count()

           Person  Sales
Company
FaceBook        2      2
Google          2      2
MicroSoft       2      2

In [15]:
by_company.describe()

                      Sales
Company
FaceBook  count    2.000000
          mean   296.500000
          std     75.660426
          min    243.000000
          25%    269.750000
          50%    296.500000
          75%    323.250000
          max    350.000000
Google    count    2.000000
          mean   160.000000
          std     56.568542
          min    120.000000
          25%    140.000000
          50%    160.000000
          75%    180.000000
          max    200.000000
MicroSoft count    2.000000
          mean   231.500000
          std    153.442172
          min    123.000000
          25%    177.250000
          50%    231.500000
          75%    285.750000
          max    340.000000

In [16]:
by_company.describe().transpose()

Company FaceBook                                                         \
           count   mean        std    min     25%    50%     75%    max
Sales        2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

Company Google         ...                 MicroSoft                     \
         count   mean  ...      75%    max     count   mean         std
Sales      2.0  160.0  ...    180.0  200.0       2.0  231.5  153.442172

Company
           min     25%    50%     75%    max
Sales    123.0  177.25  231.5  285.75  340.0

[1 rows x 24 columns]

In [18]:
by_company.describe().transpose()['Google']

       count   mean        std    min    25%    50%    75%    max
Sales    2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0